In [38]:
import pandas as pd
import re
import math
import numpy as np

## Preprocessing

In [39]:
shanghaiDataset = "https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/shanghaiData.csv"
timesDataset = "https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/timesData.csv"
worldDataset="https://raw.githubusercontent.com/DNQT/Foundation-of-Computer-Science-Project/main/Reference%20Databases/cwurData.csv"

In [40]:
def readDataSet(url , sep =',' , encoding='utf8',header='infer'):
    return pd.read_csv(url,sep=sep ,header=header,encoding=encoding)

In [41]:
# read datasets
shanghai_df=readDataSet(shanghaiDataset)
times_df=readDataSet(timesDataset)
world_df=readDataSet(worldDataset)

In [42]:
#drop the none row of shanghai

index =shanghai_df[shanghai_df['university_name'].isnull()==True]
shanghai_df.drop(index.index,inplace = True)
shanghai_df.reset_index(drop=True, inplace=True)

In [43]:
# rename institution column in university_name

world_df.rename(columns={'institution':'university_name'},inplace=True)

In [44]:
world_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   university_name       2200 non-null   object
 2   country               2200 non-null   object
 3   national_rank         2200 non-null   int64
 4   quality_of_education  2200 non-null   int64
 5   alumni_employment     2200 non-null   int64
 6   quality_of_faculty    2200 non-null   int64
 7   publications          2200 non-null   int64
 8   influence             2200 non-null   int64
 9   citations             2200 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2200 non-null   int64
 12  score                 2200 non-null   float64
 13  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 240.8+ KB

In [45]:
times_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2603 entries, 0 to 2602
Data columns (total 14 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   world_rank              2603 non-null   object
 1   university_name         2603 non-null   object
 2   country                 2603 non-null   object
 3   teaching                2603 non-null   float64
 4   international           2603 non-null   object
 5   research                2603 non-null   float64
 6   citations               2603 non-null   float64
 7   income                  2603 non-null   object
 8   total_score             2603 non-null   object
 9   num_students            2544 non-null   object
 10  student_staff_ratio     2544 non-null   float64
 11  international_students  2536 non-null   object
 12  female_male_ratio       2370 non-null   object
 13  year                    2603 non-null   int64
dtypes: float64(4), int64(1), object(9)
memory usage: 284.8+ KB

In [46]:
world_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2200 entries, 0 to 2199
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   world_rank            2200 non-null   int64
 1   university_name       2200 non-null   object
 2   country               2200 non-null   object
 3   national_rank         2200 non-null   int64
 4   quality_of_education  2200 non-null   int64
 5   alumni_employment     2200 non-null   int64
 6   quality_of_faculty    2200 non-null   int64
 7   publications          2200 non-null   int64
 8   influence             2200 non-null   int64
 9   citations             2200 non-null   int64
 10  broad_impact          2000 non-null   float64
 11  patents               2200 non-null   int64
 12  score                 2200 non-null   float64
 13  year                  2200 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 240.8+ KB

In [47]:
todo:
    
    da trovare le colone communi

SyntaxError: invalid syntax (<ipython-input-47-fe032c2479ae>, line 1)

### 1. For each university, extract from the times dataset the most recent and the least recent data, obtaining two separate dataframes

In [59]:
def extract_dataset_min_max(university_name, year, index ):
    '''
    find most recent or least recent of data
    
    @university_name  : column university name 
    @year : column year
    @index : max or min
    
    '''
    dataset = pd.DataFrame()
    if(index == 'max'):
          dataset = times_df.iloc[timesDF.groupby(university_name)[year].idxmax()]
            
    else: dataset = times_df.iloc[timesDF.groupby(university_name)[year].idxmin()]
    return dataset

In [60]:
times_most_recent_data = extract_dataset('university_name','year','max')

In [61]:
times_least_recent_data = extract_dataset('university_name','year','min')

In [62]:
times_most_recent_data.to_csv("times_most_recent_data")
times_least_recent_data.to_csv("times_least_recent_data")

In [63]:
times_most_recent_data[['world_rank','university_name','year']].head(20)

     world_rank                           university_name  year
2405    601-800  AGH University of Science and Technology  2016
2003    201-250                        Aalborg University  2016
2056    251-300                          Aalto University  2016
1908       =106                         Aarhus University  2016
2105    301-350                    Aberystwyth University  2016
2404    601-800                Adam Mickiewicz University  2016
2057    251-300                  Aix-Marseille University  2016
2406    601-800                           Ajou University  2016
2408    601-800                     Alexandria University  2016
2409    601-800            Alexandru Ioan Cuza University  2016
2410    601-800                 Aligarh Muslim University  2016
2204    401-500                       American University  2016
2303    501-600             American University of Beirut  2016
2411    601-800            American University of Sharjah  2016
2304    501-600        Amirkabir University of Technology  2016
2412    601-800                         Amrita University  2016
2413    601-800                        Anadolu University  2016
2414    601-800                         Andhra University  2016
2416    601-800      Aristotle University of Thessaloniki  2016
1991        189                  Arizona State University  2016

In [64]:
times_least_recent_data[['world_rank','university_name','year']].head(20)

     world_rank                           university_name  year
2405    601-800  AGH University of Science and Technology  2016
501     301-350                        Aalborg University  2012
502     301-350                          Aalto University  2012
166         167                         Aarhus University  2011
476     276-300                    Aberystwyth University  2012
2404    601-800                Adam Mickiewicz University  2016
2057    251-300                  Aix-Marseille University  2016
2406    601-800                           Ajou University  2016
146         147                     Alexandria University  2011
2409    601-800            Alexandru Ioan Cuza University  2016
2410    601-800                 Aligarh Muslim University  2016
2204    401-500                       American University  2016
2303    501-600             American University of Beirut  2016
2411    601-800            American University of Sharjah  2016
2304    501-600        Amirkabir University of Technology  2016
2412    601-800                         Amrita University  2016
2413    601-800                        Anadolu University  2016
2414    601-800                         Andhra University  2016
2416    601-800      Aristotle University of Thessaloniki  2016
160         161                  Arizona State University  2011

In [ ]:
times_least_recent_data = times_ranking.iloc[times_ranking.groupby('university_name')['year'].idxmin()]
times_least_recent_data.head(3)